papers/scaleup/generate_scaleup_runs/template/0.orig/omega.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

#include "${FOAM_CASE}/constant/globalVars"

internalField   uniform $omega_inlet_liq;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $omega_inlet_liq;
    }

    outlet
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            omegaWallFunction;
        value           $internalField;
    }

}

// ************************************************************************* //
