papers/scaleup/generate_scaleup_runs/template/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1.0;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
vertices
(
( 0.0 0.0  0.0)
( 1.0 0.0  0.0)
( 2.0 0.0  0.0)
( 3.0 0.0  0.0)
( 4.0 0.0  0.0)
( 5.0 0.0  0.0)
( 6.0 0.0  0.0)
( 7.0 0.0  0.0)
( 8.0 0.0  0.0)
( 9.0 0.0  0.0)
( 10.0 0.0  0.0)
( 0.0 1.0  0.0)
( 1.0 1.0  0.0)
( 2.0 1.0  0.0)
( 3.0 1.0  0.0)
( 4.0 1.0  0.0)
( 5.0 1.0  0.0)
( 6.0 1.0  0.0)
( 7.0 1.0  0.0)
( 8.0 1.0  0.0)
( 9.0 1.0  0.0)
( 10.0 1.0  0.0)
( 0.0 2.0  0.0)
( 1.0 2.0  0.0)
( 2.0 2.0  0.0)
( 3.0 2.0  0.0)
( 4.0 2.0  0.0)
( 5.0 2.0  0.0)
( 6.0 2.0  0.0)
( 7.0 2.0  0.0)
( 8.0 2.0  0.0)
( 9.0 2.0  0.0)
( 10.0 2.0  0.0)
( 0.0 3.0  0.0)
( 1.0 3.0  0.0)
( 2.0 3.0  0.0)
( 3.0 3.0  0.0)
( 4.0 3.0  0.0)
( 5.0 3.0  0.0)
( 6.0 3.0  0.0)
( 7.0 3.0  0.0)
( 8.0 3.0  0.0)
( 9.0 3.0  0.0)
( 10.0 3.0  0.0)
( 0.0 4.0  0.0)
( 1.0 4.0  0.0)
( 2.0 4.0  0.0)
( 3.0 4.0  0.0)
( 4.0 4.0  0.0)
( 5.0 4.0  0.0)
( 6.0 4.0  0.0)
( 7.0 4.0  0.0)
( 8.0 4.0  0.0)
( 9.0 4.0  0.0)
( 10.0 4.0  0.0)
( 0.0 5.0  0.0)
( 1.0 5.0  0.0)
( 2.0 5.0  0.0)
( 3.0 5.0  0.0)
( 4.0 5.0  0.0)
( 5.0 5.0  0.0)
( 6.0 5.0  0.0)
( 7.0 5.0  0.0)
( 8.0 5.0  0.0)
( 9.0 5.0  0.0)
( 10.0 5.0  0.0)
( 0.0 6.0  0.0)
( 1.0 6.0  0.0)
( 2.0 6.0  0.0)
( 3.0 6.0  0.0)
( 4.0 6.0  0.0)
( 5.0 6.0  0.0)
( 6.0 6.0  0.0)
( 7.0 6.0  0.0)
( 8.0 6.0  0.0)
( 9.0 6.0  0.0)
( 10.0 6.0  0.0)
( 0.0 7.0  0.0)
( 1.0 7.0  0.0)
( 2.0 7.0  0.0)
( 3.0 7.0  0.0)
( 4.0 7.0  0.0)
( 5.0 7.0  0.0)
( 6.0 7.0  0.0)
( 7.0 7.0  0.0)
( 8.0 7.0  0.0)
( 9.0 7.0  0.0)
( 10.0 7.0  0.0)
( 0.0 0.0  1.0)
( 1.0 0.0  1.0)
( 2.0 0.0  1.0)
( 3.0 0.0  1.0)
( 4.0 0.0  1.0)
( 5.0 0.0  1.0)
( 6.0 0.0  1.0)
( 7.0 0.0  1.0)
( 8.0 0.0  1.0)
( 9.0 0.0  1.0)
( 10.0 0.0  1.0)
...
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
blocks
(

 //block 0
hex (0 1 12 11 88 89 100 99 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 1
hex (1 2 13 12 89 90 101 100 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 2
hex (2 3 14 13 90 91 102 101 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 3
hex (3 4 15 14 91 92 103 102 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 4
hex (4 5 16 15 92 93 104 103 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 5
hex (5 6 17 16 93 94 105 104 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 6
hex (6 7 18 17 94 95 106 105 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 7
hex (7 8 19 18 95 96 107 106 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 8
hex (8 9 20 19 96 97 108 107 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 9
hex (9 10 21 20 97 98 109 108 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 10
hex (97 98 109 108 185 186 197 196 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 11
hex (185 186 197 196 273 274 285 284 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 12
hex (273 274 285 284 361 362 373 372 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 13
hex (361 362 373 372 449 450 461 460 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 14
hex (360 361 372 371 448 449 460 459 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 15
hex (359 360 371 370 447 448 459 458 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 16
hex (358 359 370 369 446 447 458 457 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 17
hex (357 358 369 368 445 446 457 456 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 18
hex (356 357 368 367 444 445 456 455 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 19
hex (355 356 367 366 443 444 455 454 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 20
hex (354 355 366 365 442 443 454 453 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 21
hex (353 354 365 364 441 442 453 452 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 22
hex (352 353 364 363 440 441 452 451 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 23
hex (363 364 375 374 451 452 463 462 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 24
hex (374 375 386 385 462 463 474 473 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 25
hex (385 386 397 396 473 474 485 484 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 26
hex (396 397 408 407 484 485 496 495 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 27
hex (407 408 419 418 495 496 507 506 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 28
hex (418 419 430 429 506 507 518 517 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 29
hex (308 309 320 319 396 397 408 407 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 30
hex (220 221 232 231 308 309 320 319 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 31
hex (132 133 144 143 220 221 232 231 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 32
hex (44 45 56 55 132 133 144 143 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 33
hex (55 56 67 66 143 144 155 154 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 34
hex (66 67 78 77 154 155 166 165 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 35
hex (33 34 45 44 121 122 133 132 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 36
hex (22 23 34 33 110 111 122 121 )
( 10 10 10 )
SimpleGrading (1 1 1)

 //block 37
hex (11 12 23 22 99 100 111 110 )
( 10 10 10 )
SimpleGrading (1 1 1)
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
defaultPatch
{   type wall;}

patches
(
);
