papers/scaleup/generate_scaleup_runs/template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     birdmultiphaseEulerFoam;

startFrom       latestTime;//startTime;

startTime       0;

stopAt          endTime;

endTime         200;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.25;

maxDeltaT       0.005;


functions
{

    #includeFunc    writeObjects(d.gas)
    #includeFunc    writeObjects(thermo:rho.gas)
    #includeFunc    writeObjects(thermo:rho.liquid)
}
//functions
//{
//    #includeFunc fieldAverage(U.air, U.water, alpha.air, p)
//}


// ************************************************************************* //
